InformationRegisters/БизнесПроцессыЗначенияСвойств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>БизнесПроцессыЗначенияСвойств</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Процесс</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.БизнесПроцессы</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БизнесПроцессыСвойства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/БизнесПроцессыЗначенияСвойств/Ext/ManagerModule.bsl
Функция Добавить(Период, Процесс, Свойство, Значение, ТипЗначения = "Строка") Экспорт
	//Параметр ТипЗначения - устарел, не используется, оставлен для совместимости (тип значения перенесен в реквизит свойства)
	
	ЗначениеПоУмолчанию = Ложь;
	
	Данные = "Период = "+Период+"; Процесс = "+Процесс+"; Свойство = "+Свойство+" ;Значение = "+Значение+" ;ТипЗначения = " + ТипЗначения;
	
	Доступно = ЗначениеЗаполнено(Период);
	Доступно = Доступно И ЗначениеЗаполнено(Процесс);
	Доступно = Доступно И Процесс <> Неопределено;
	Доступно = Доступно И ЗначениеЗаполнено(Свойство);   
	Доступно = Доступно И ЗначениеЗаполнено(Значение);
	
	Если Не Доступно Тогда
		Комментарий = "Ошибка в заполнении аргументов";
		ОбслуживаниеСервер.ЗарегистрироватьСобытие("Добавить()", УровеньЖурналаРегистрации.Ошибка, Метаданные.РегистрыСведений.БизнесПроцессыЗначенияСвойств, Данные, Комментарий);
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	
	МЗ = РегистрыСведений.БизнесПроцессыЗначенияСвойств.СоздатьМенеджерЗаписи();
	МЗ.Период 		= Период;
	МЗ.Процесс 		= Процесс;
	МЗ.Свойство 	= Свойство;
	МЗ.Значение 	= Значение;
	
	Попытка	
		МЗ.Записать(Ложь);
	Исключение
		Комментарий = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("Добавить()", УровеньЖурналаРегистрации.Ошибка, , Данные, Комментарий);
		Возврат ЗначениеПоУмолчанию;
	КонецПопытки;
КонецФункции
